In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})
df

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [5]:
df.iloc[1,1], df.iloc[8,0]

(2014, 'Maruti')

In [12]:
# select 3 to 6 rows and first two columns
df.iloc[3:7, 0:2]

      Brand  Year
3  Mahindra  2015
4    Maruti  2012
5   Hyundai  2016
6   Renault  2014

In [13]:
df.iloc[3:7, 0:2].set_index('Brand')

          Year
Brand
Mahindra  2015
Maruti    2012
Hyundai   2016
Renault   2014

In [15]:
df.head(5)

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       28
1   Hyundai  2014       30000    Delhi       27
2      Tata  2011       60000   Mumbai       25
3  Mahindra  2015       25000    Delhi       26
4    Maruti  2012       10000   Mumbai       28

In [23]:
df.loc[0, "Brand"], df.iloc[0,0]

('Maruti', 'Maruti')

In [20]:
data = [[50, True], [40, False], [30, False]]
label_rows = ["Sally", "Mary", "John"]
label_cols = ["age", "qualified"]

df1 = pd.DataFrame(data, label_rows, label_cols)
df1

       age  qualified
Sally   50       True
Mary    40      False
John    30      False

In [21]:
df1.loc["Mary", "age"]

40